задачник_едт/src/Documents/ОбращениеВПоддержку/ОбращениеВПоддержку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеВПоддержку</name>
  <registerRecords>AccumulationRegister.ЗадолженостьКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетСИсполнителями</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВидВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьДо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбращениеОт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяКатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийОтделИсполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьДатуВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеальныйИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоПрограммисту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>прогДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>прогДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.узСпринты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПоказывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>DocumentRef.ЭтапПроекта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>240</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяРешением</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.Статусы</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавил</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетРабочегоВремени</name>
    <attributes>
      <name>ДатаНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ВложенныйФайл</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДетализированыйПланВыполнения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеальныйПланВыполнения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

задачник_едт/src/AccumulationRegisters/ЗадолженостьКлиентов/ЗадолженостьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженостьКлиентов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.ОбращениеВПоддержку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/AccumulationRegisters/РасчетСИсполнителями/РасчетСИсполнителями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетСИсполнителями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.ОбращениеВПоддержку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

задачник_едт/src/InformationRegisters/СтатусыОбращений/СтатусыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбращений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Статусы</types>
    </type>
  </resources>
  <resources>
    <name>ОбращениеОт</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.ОбращениеВПоддержку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

задачник_едт/src/InformationRegisters/КатегорииИсполнителиОбращений/КатегорииИсполнителиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КатегорииИсполнителиОбращений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительОтдел</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.ОбращениеВПоддержку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

задачник_едт/src/Documents/ОбращениеВПоддержку/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтапПроекта.Завершен Тогда
		Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = СтрШаблон(НСтр("ru = 'Проведение задач по этапу проекта: %1 запрещено! Этап завершен!' "), ЭтапПроекта);
	    Сообщение.УстановитьДанные(Ссылка);
	    Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//TODO: Удалить старый алгоритм проведения после полного перехода на новый вариант
	УдалитьДвижения();
	
	Если НЕ Отказ Тогда
		ЗаписатьВРегистрСтатусыОбращений();
		ЗаписатьВРегистрКатегорииИсполнители()
	КонецЕсли;

	СформироватьДвиженияПоЗадолженостям();
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.ОбращениеВПоддержку.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СебестоимостьСервер.ОтразитьСебестоимость(ДополнительныеСвойства, Движения, Отказ);
	ВзаиморасчетыСИсполнителямиСервер.ОтразитьВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура УдалитьДвижения()
	Для Каждого ТаблицаДвижений из Движения Цикл
		ТаблицаДвижений.Очистить();
		ТаблицаДвижений.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьДвиженияПоЗадолженостям()
	Движение = Движения.ЗадолженостьКлиентов.Добавить();
	Движение.Регистратор= Ссылка;
	Движение.Период 	= Дата;
	Движение.ВидДвижения= ВидДвиженияНакопления.Приход;
	Движение.Задача		= Ссылка;
	Движение.Отделение	= ОбращениеОт;
	Движение.Сумма		= СтоимостьРабот;

	Движение = Движения.РасчетСИсполнителями.Добавить();
	Движение.Регистратор= Ссылка;
	Движение.Период 	= Дата;
	Движение.ВидДвижения= ВидДвиженияНакопления.Приход;
	Движение.Задача		= Ссылка;
	Движение.Отделение	= ОбращениеОт;
	Движение.Исполнитель= РеальныйИсполнитель;
	Движение.Сумма		= Себестоимость;
	
	Если Оплачено Тогда
		Движение = Движения.ЗадолженостьКлиентов.Добавить();
		Движение.Регистратор= Ссылка;
		Движение.Период 	= Дата;
		Движение.ВидДвижения= ВидДвиженияНакопления.Расход;
		Движение.Задача		= Ссылка;
		Движение.Отделение	= ОбращениеОт;
		Движение.Сумма		= СтоимостьРабот;
	КонецЕсли;
	
	Если ОплаченоПрограммисту Тогда
		Движение = Движения.РасчетСИсполнителями.Добавить();
		Движение.Регистратор= Ссылка;
		Движение.Период 	= Дата;
		Движение.ВидДвижения= ВидДвиженияНакопления.Расход;
		Движение.Задача		= Ссылка;
		Движение.Отделение	= ОбращениеОт;
		Движение.Исполнитель= РеальныйИсполнитель;
		Движение.Сумма		= Себестоимость;
	КонецЕсли;
	
	Движения.ЗадолженостьКлиентов.Записать();
	Движения.РасчетСИсполнителями.Записать();
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Не Отказ Тогда
		УдалитьИзРегистрСтатусыОбращений();
		УдалитьИзРегистрКатегорииИсполнители();
	КонецЕсли;
	УдалитьДвижения();
КонецПроцедуры

Процедура ЗаписатьВРегистрСтатусыОбращений()
	 	СтатусыОбращений = РегистрыСведений.СтатусыОбращений.СоздатьНаборЗаписей();
	    СтатусыОбращений.Отбор.Обращение.Установить(Ссылка);
		
		Для Каждого ТекСтрокаСтатусы Из Статусы Цикл
			НоваяСтрока = СтатусыОбращений.Добавить();
			НоваяСтрока.Период = ТекСтрокаСтатусы.Дата;
			НоваяСтрока.Обращение = Ссылка;
			НоваяСтрока.Статус = ТекСтрокаСтатусы.Статус;
			НоваяСтрока.ОбращениеОт = ОбращениеОт;
			НоваяСтрока.Заголовок = Заголовок;
		КонецЦикла;

		СтатусыОбращений.Записать();

КонецПроцедуры

Процедура УдалитьИзРегистрСтатусыОбращений()
	СтатусыОбращений = РегистрыСведений.СтатусыОбращений.СоздатьНаборЗаписей();
	СтатусыОбращений.Отбор.Обращение.Установить(Ссылка);

	//СтатусыОбращений.Очистить();
	СтатусыОбращений.Записать();
КонецПроцедуры

Процедура ЗаписатьВРегистрКатегорииИсполнители()
	 	КатегорииИсполнители = РегистрыСведений.КатегорииИсполнителиОбращений.СоздатьНаборЗаписей();
	    КатегорииИсполнители.Отбор.Обращение.Установить(Ссылка);
		
		Для Каждого ТекСтрокаИсполнители Из Исполнители Цикл
			НоваяСтрока = КатегорииИсполнители.Добавить();
			НоваяСтрока.Период = ТекСтрокаИсполнители.Дата;
			НоваяСтрока.Обращение = Ссылка;
			НоваяСтрока.Категория = ТекСтрокаИсполнители.Категория;
			НоваяСтрока.ИсполнительОтдел = ТекСтрокаИсполнители.Отдел;
			НоваяСтрока.Исполнитель = ТекСтрокаИсполнители.Исполнитель;
		КонецЦикла;
		
		КатегорииИсполнители.Записать();

КонецПроцедуры

Процедура УдалитьИзРегистрКатегорииИсполнители()
	КатегорииИсполнители = РегистрыСведений.КатегорииИсполнителиОбращений.СоздатьНаборЗаписей();
	КатегорииИсполнители.Отбор.Обращение.Установить(Ссылка);

	КатегорииИсполнители.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() тогда
		ДополнительныеСвойства.Вставить("СтарыйСтатус", Справочники.Статусы.ПустаяСсылка());
		ДополнительныеСвойства.Вставить("СтарыйРеальныйИсполнитель", Справочники.ФизическиеЛица.ПустаяСсылка());
	Иначе
		ДополнительныеСвойства.Вставить("СтарыйСтатус", Ссылка.ТекущийСтатус);
		ДополнительныеСвойства.Вставить("СтарыйРеальныйИсполнитель", Ссылка.РеальныйИсполнитель);
	КонецЕсли;
	
	ПланированиеЗадач.ИзменитьДетальноеПланированиеПриИзмененииШапки(ЭтотОбъект, "ДетализированыйПланВыполнения", Истина);
	ПланированиеЗадач.ИзменитьДетальноеПланированиеПриИзмененииШапки(ЭтотОбъект, "РеальныйПланВыполнения", Истина, Ложь);
	Корректно = ПланированиеЗадач.ПроверитьКорректностьПериодизации(ЭтотОбъект,  "ДетализированыйПланВыполнения");
	Корректно = Корректно И ПланированиеЗадач.ПроверитьКорректностьПериодизации(ЭтотОбъект,  "РеальныйПланВыполнения");
	
	Если Не Корректно Тогда
		Сообщить("Не верный порядок периодизации планирования!");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
